ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L40x/N32L406.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>PWR</name>
            <description>Power control</description>
            <groupName>PWR</groupName>
            <baseAddress>0x40007000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PVD</name>
                <description>PVD through EXTI line detection interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>PWR_CTRL1</name>
                    <displayName>PWR_CTRL1</displayName>
                    <description>PWR_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000700</resetValue>
                    <resetMask>0x00004707</resetMask>
                    <fields>
                        <field>
                            <name>LPMSEL</name>
                            <description>LPMSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DRBP</name>
                            <description>DRBP</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MRSEL</name>
                            <description>MRSEL</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>LPREN</name>
                            <description>LPREN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>					
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL2</name>
                    <displayName>PWR_CTRL2</displayName>
                    <description>PWR_CTRL</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>PVDEN</name>
                            <description>PVDEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLS</name>
                            <description>PLS</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PVDFLTENL</name>
                            <description>PVDFLTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>					
                    </fields>
                </register>	
                <register>
                    <name>PWR_CTRL3</name>
                    <displayName>PWR_CTRL3</displayName>
                    <description>PWR_CTRL</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00070700</resetValue>
                    <resetMask>0x0037777</resetMask>
                    <fields>
                        <field>
                            <name>WKUP1EN</name>
                            <description>WKUP1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP2EN</name>
                            <description>WKUP2EN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP3EN</name>
                            <description>WKUP3EN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>WKUP1PS</name>
                            <description>WKUP1PS</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>		
                        <field>
                            <name>WKUP2PS</name>
                            <description>WKUP2PS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>WKUP3PS</name>
                            <description>WKUP3PS</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BGDTLPR</name>
                            <description>BGDTLPR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>BGDTSTP2</name>
                            <description>BGDTSTP2</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BGDTSTBY</name>
                            <description>BGDTSTBY</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RAM1RET</name>
                            <description>RAM1RET</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>RAM2RET</name>
                            <description>RAM2RET</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>WKUPLEN</name>
                            <description>WKUPLEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBDTLPR</name>
                            <description>PBDTLPR</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBDTSTP2</name>
                            <description>PBDTSTP2</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBDTSTBY</name>
                            <description>PBDTSTBY</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>PSTSTBY</name>
                            <description>PSTSTBY</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>PSTSTP2</name>
                            <description>PSTSTP2</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>													
                    </fields>
                </register>	
                <register>
                    <name>PWR_STS1</name>
                    <displayName>PWR_STS1</displayName>
                    <description>PWR_STS</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00008107</resetMask>
                    <fields>
                        <field>
                            <name>WKUPF1</name>
                            <description>WKUPF1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPF2</name>
                            <description>WKUPF2</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPF3</name>
                            <description>WKUPF3</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>STBYF</name>
                            <description>STBYF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWKUPF</name>
                            <description>IWKUPF</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>					
                    </fields>
                </register>	
                <register>
                    <name>PWR_STS2</name>
                    <displayName>PWR_STS2</displayName>
                    <description>PWR_STS</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0x0000007</resetMask>
                    <fields>
                        <field>
                            <name>LPRUNF</name>
                            <description>LPRUNF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MRF</name>
                            <description>MRF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDO</name>
                            <description>PVDO</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>					
                <register>
                    <name>PWR_STSCLR</name>
                    <displayName>PWR_STSCLR</displayName>
                    <description>PWR_STSCLR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000107</resetMask>
                    <fields>
                        <field>
                            <name>CLRWKUP1</name>
                            <description>CLRWKUP1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRWKUP2</name>
                            <description>CLRWKUP2</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRWKUP3</name>
                            <description>CLRWKUP3</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRSTBY</name>
                            <description>CLRSTBY</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>		
