ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L40x/N32L406.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIM6">
            <name>TIM7</name>
            <baseAddress>0x40001400</baseAddress>
            <interrupt>
                <name>TIM7</name>
                <description>TIM7 global interrupt</description>
                <value>52</value>
            </interrupt>
        </peripheral>

        <peripheral>
            <name>TSC</name>
            <description>touch screen control</description>
            <groupName>TSC</groupName>
            <baseAddress>0x40003400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TSC</name>
                <description>TSC global interrupt</description>
                <value>62</value>
            </interrupt>
            <registers>
                <register>
                    <name>TSC_CTRL</name>
                    <displayName>TSC_CTRL</displayName>
                    <description>TSC_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000703</resetValue>
                    <resetMask>0x000037ff</resetMask>
                    <fields>
                        <field>
                            <name>DET_PERIOD</name>
                            <description>DET_PERIOD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DET_FILTER</name>
                            <description>DET_FILTER</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>HW_DET_MODE</name>
                            <description>HW_DET_MODE</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HW_DET_ST</name>
                            <description>HW_DET_ST</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LESS_DET_SEL</name>
                            <description>LESS_DET_SEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GREAT_DET_SEL</name>
                            <description>GREAT_DET_SEL</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DET_INTEN</name>
                            <description>DET_INTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4_ETR</name>
                            <description>TIM4_ETR</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM2_ETR_CH1</name>
                            <description>TIM2_ETR_CH1</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_CHNEN</name>
                    <displayName>TSC_CHNEN</displayName>
                    <description>TSC_CHNEN</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffffff</resetMask>
                    <fields>
                        <field>
                            <name>CHN_SEL</name>
                            <description>CHN_SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_STS</name>
                    <displayName>TSC_STS</displayName>
                    <description>TSC_STS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001f37ff</resetMask>
                    <fields>
                        <field>
                            <name>CNT_VAL</name>
                            <description>CNT_VAL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>LESS_DET</name>
                            <description>LESS_DET</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GREAT_DET</name>
                            <description>GREAT_DET</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHN_NUM</name>
                            <description>CHN_NUM</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_ANA_CTRL</name>
                    <displayName>TSC_ANA_CTRL</displayName>
                    <description>TSC_ANA_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>SW_PAD_MUX</name>
                            <description>SW_PAD_MUX</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SW_TSC_EN</name>
                            <description>SW_TSC_EN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_ANA_SEL</name>
                    <displayName>TSC_ANA_SEL</displayName>
                    <description>TSC_ANA_SEL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000008</resetValue>
                    <resetMask>0x00000070</resetMask>
                    <fields>
                        <field>
                            <name>SP_OPT</name>
                            <description>SP_OPT</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PAD_OPT</name>
                            <description>PAD_OPT</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_RESR0</name>
                    <displayName>TSC_RESR0</displayName>
                    <description>TSC_RESR0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x44444444</resetValue>
                    <resetMask>0x77777777</resetMask>
                    <fields>
                        <field>
                            <name>CHN_RESIST0</name>
                            <description>CHN_RESIST0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST1</name>
                            <description>CHN_RESIST1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST2</name>
                            <description>CHN_RESIST2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST3</name>
                            <description>CHN_RESIST3</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST4</name>
                            <description>CHN_RESIST4</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST5</name>
                            <description>CHN_RESIST5</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST6</name>
                            <description>CHN_RESIST6</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST7</name>
                            <description>CHN_RESIST7</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_RESR1</name>
                    <displayName>TSC_RESR1</displayName>
                    <description>TSC_RESR1</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x44444444</resetValue>
                    <resetMask>0x77777777</resetMask>
                    <fields>
                        <field>
                            <name>CHN_RESIST8</name>
                            <description>CHN_RESIST8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST9</name>
                            <description>CHN_RESIST9</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST10</name>
                            <description>CHN_RESIST10</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST11</name>
                            <description>CHN_RESIST11</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST12</name>
                            <description>CHN_RESIST12</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST13</name>
                            <description>CHN_RESIST13</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST14</name>
                            <description>CHN_RESIST14</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST15</name>
                            <description>CHN_RESIST15</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_RESR2</name>
                    <displayName>TSC_RESR2</displayName>
                    <description>TSC_RESR2</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x44444444</resetValue>
                    <resetMask>0x77777777</resetMask>
                    <fields>
                        <field>
                            <name>CHN_RESIST16</name>
                            <description>CHN_RESIST16</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST17</name>
                            <description>CHN_RESIST17</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST18</name>
                            <description>CHN_RESIST18</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST19</name>
                            <description>CHN_RESIST19</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST20</name>
                            <description>CHN_RESIST20</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST21</name>
                            <description>CHN_RESIST21</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST22</name>
                            <description>CHN_RESIST22</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CHN_RESIST23</name>
                            <description>CHN_RESIST23</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD0</name>
                    <displayName>TSC_THRHD0</displayName>
                    <description>TSC_THRHD0</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE0</name>
                            <description>BASE0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA0</name>
                            <description>DELTA0</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD1</name>
                    <displayName>TSC_THRHD1</displayName>
                    <description>TSC_THRHD1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE1</name>
                            <description>BASE1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA1</name>
                            <description>DELTA1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD2</name>
                    <displayName>TSC_THRHD2</displayName>
                    <description>TSC_THRHD2</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE2</name>
                            <description>BASE2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA2</name>
                            <description>DELTA2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD3</name>
                    <displayName>TSC_THRHD3</displayName>
                    <description>TSC_THRHD3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE3</name>
                            <description>BASE3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA3</name>
                            <description>DELTA3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD4</name>
                    <displayName>TSC_THRHD4</displayName>
                    <description>TSC_THRHD4</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE4</name>
                            <description>BASE4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA4</name>
                            <description>DELTA4</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
